{"Q": "The sanctions against the school were a punishing blow, and they seemed to what the efforts the school had made to change?", "Answer Choices": "(a) ignore\n(b) enforce\n(c) authoritarian\n(d) yell at\n(e) avoid", "A": "The answer must be something that reflects a negative impact on the efforts made to change. Of the above choices, only ignore fits this context. So the answer is (a)."}
{"Q": "Sammy wanted to go to where the people were. Where might he go?", "Answer Choices": "(a) race track\n(b) populated areas\n(c) the desert\n(d) apartment\n(e) roadblock", "A": "The answer must be a place with many people. Of the above choices, populated areas is the best fit. So the answer is (b)."}
{"Q": "To locate a choker not located in a jewelry box or boutique where would you go?", "Answer Choices": "(a) jewelry store\n(b) neck\n(c) jewelry box\n(d) jewelry box\n(e) boutique", "A": "The answer must be a place where a choker is typically found. Of the above choices, neck is the best fit. So the answer is (b)."}
{"Q": "Google Maps and other highway and street GPS services have replaced what?", "Answer Choices": "(a) united states\n(b) mexico\n(c) countryside\n(d) atlas\n(e) oceans", "A": "The answer must be something that was used for navigation before GPS services. Of the above choices, atlas is the best fit. So the answer is (d)."}
{"Q": "The fox walked from the city into the forest, what was it looking for?", "Answer Choices": "(a) pretty flowers.\n(b) hen house\n(c) natural habitat\n(d) storybook\n(e) dense forest", "A": "The answer must be a place where a fox would feel comfortable. Of the above choices, natural habitat is the best fit. So the answer is (c)."}
{"Q": "What home entertainment equipment requires cable?", "Answer Choices": "(a) radio shack\n(b) substation\n(c) cabinet\n(d) television\n(e) desk", "A": "The answer must be an item that typically requires cable. Of the above choices, only television requires cable. So the answer is (d)."}
{"Q": "The only baggage the woman checked was a drawstring bag, where was she heading with it?", "Answer Choices": "(a) garbage can\n(b) military\n(c) jewelry store\n(d) safe\n(e) airport", "A": "The answer must be a place where people check their baggage. Of the above choices, airport is the best fit. So the answer is (e)."}
{"Q": "The forgotten leftovers had gotten quite old, he found it covered in mold in the back of his what?", "Answer Choices": "(a) carpet\n(b) refrigerator\n(c) breadbox\n(d) fridge\n(e) coach", "A": "The answer must be a place where food is stored and can get moldy. Of the above choices, refrigerator is the best fit. So the answer is (b)."}
{"Q": "What do people use to absorb extra ink from a fountain pen?", "Answer Choices": "(a) shirt pocket\n(b) calligrapher’s hand\n(c) inkwell\n(d) desk drawer\n(e) blotter", "A": "The answer must be an item that can absorb ink. Of the above choices, only blotters are used to absorb ink. So the answer is (e)."}
{"Q": "Where is a business restaurant likely to be located?", "Answer Choices": "(a) town\n(b) at hotel\n(c) mall\n(d) business sector\n(e) yellow pages", "A": "The answer must be a place where business restaurants are commonly found. Of the above choices, business sector is the best fit. So the answer is (d)."}
{"Q": "Where do you put your grapes just before checking out?", "Answer Choices": "(a) mouth\n(b) grocery cart\n(c) super market\n(d) fruit basket\n(e) fruit market", "A": "The answer must be a place where grapes are placed before checking out at a store. Of the above choices, grocery cart is the best fit. So the answer is (b)."}
{"Q": "Before getting a divorce, what did the wife feel who was doing all the work?", "Answer Choices": "(a) harder\n(b) anguish\n(c) bitterness\n(d) tears\n(e) sadness", "A": "The answer must be an emotion related to the difficulties before divorce. Of the above choices, bitterness is the best fit. So the answer is (c)."}
{"Q": "Johnny sat on a bench and relaxed after doing a lot of work on his hobby. Where is he?", "Answer Choices": "(a) state park\n(b) bus depot\n(c) garden\n(d) gym\n(e) rest area", "A": "The answer must be a place where one can find a bench to sit and relax. Of the above choices, garden is the best fit. So the answer is (c)."}
{"Q": "James was cooling off too quickly. He would die if he didn't find some way to stop what?", "Answer Choices": "(a) loss of heat\n(b) revenge\n(c) expansion\n(d) relaxation\n(e) calm down", "A": "The answer must be something that needs to be stopped to prevent death. Of the above choices, loss of heat is the best fit. So the answer is (a)."}
{"Q": "Of all the rooms in a house it was his favorite, the aromas always drew him to the what?", "Answer Choices": "(a) yard\n(b) basement\n(c) kitchen\n(d) living room\n(e) garden", "A": "The answer must be a room known for aromas. Of the above choices, kitchen is the best fit. So the answer is (c)."}
{"Q": "Bill is stuck in a marsh when a man comes up to him speaking Cajun, where is he?", "Answer Choices": "(a) low lands\n(b) New York\n(c) forest\n(d) Louisiana\n(e) Everglades", "A": "The answer must be a place associated with marshes and Cajun culture. Of the above choices, Louisiana is the best fit. So the answer is (d)."}
